REBOOT_MESSAGE = (
    'Бот был перезагружен. \n'
    'Для корректной работы бота \n'
    'введите в чате команду /start')

MAX_NUMBER_OF_PIN_NOTES = 7

MIN_LEN_NOTE_TITLE = 1
MAX_LEN_NOTE_TITLE = 20

MIN_LEN_NOTE_TEXT = 1
MAX_LEN_NOTE_TEXT = 5_000

MIN_LEN_CATEGORY_TITLE = 1
MAX_LEN_CATEGORY_TITLE = 20

NUMBER_OF_NOTES_PER_PAGE = 6
NUMBER_OF_WORDS_TO_REDUCE = 10

PLUS_HOURS_FOR_DB = 3

DESCRIPTION_BOT_MSG = (
    '👋 Привет! \n'
    'Этот бот поможет тебе удобно создавать и хранить текстовые заметки прямо '
    'в Telegram.\n'
    '\n'
    'Возможности:\n'
    '🗂️ До 5 категорий для организации заметок\n'
    '📌 Закрепляй до 7 важных заметок\n'
    '📝 Удобный и простой интерфейс\n'
    '\n'
    '✨Для начала работы нажмите кнопку старт или введите в чате '
    'с ботом /start\n'
    '📬 Связь с разработчиком: @golovin91k')

ERROR_MSG_WITHOUT_PERMISSION = (
    'Нет доступа. Попробуйте ввести /start в чат и заново повторить действие')
